cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'direnv'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'imagemagick'
brew 'libmagic'
brew 'links'
brew 'mas'
brew 'mysql@5.7'
brew 'node'
brew 'phantomjs'
brew 'postgresql'
brew 'rbenv'
brew 'telnet'
brew 'tmux'
brew 'watch'
brew 'wget'

brew 'pv'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask 'atom'
cask 'chromium'
cask 'docker-toolbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'java'
cask 'mysqlworkbench'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'

cask 'coconutbattery'
cask 'cryptomator'
cask 'cyberduck'
cask 'dash'
cask 'evernote'
cask 'filebot'
cask 'handbrake'
cask 'jdownloader'
cask 'sonos'
cask 'steam'
cask 'tunnelblick'
cask 'dropbox'
cask 'fork'
cask 'google-chrome-canary'
cask 'gpg-suite'
cask 'grandperspective'
cask 'libreoffice'
cask 'moneymoney'
cask 'opera'
cask 'teamviewer'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'

mas "Browser Fairy", id: 483014855
mas "Microsoft Remote Desktop", id: 715768417
mas "Slack", id: 803453959
mas "SSH Tunnel Manager", id: 424470626
mas "Trello", id: 1278508951
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
